import pytest
from decrypt import decrypt

# Группируем тесты по логике точек

@pytest.mark.parametrize(
    "cipher, expected",
    [
        ("абра-кадабра.", "абра-кадабра"),
        ("абраа..-кадабра", "абра-кадабра"),
        ("абраа..-.кадабра", "абра-кадабра"),
        ("абра--..кадабра", "абра-кадабра"),
        ("абрау...-кадабра", "абра-кадабра"),
        ("абра........", ""),
        ("абр......a.", "a"),
        ("1..2.3", "23"),
        (".", ""),
        ("1.......................", "")
    ]
)
def test_decrypt_cases(cipher, expected):
    """
    Проверка всех заданных шифровок и расшифровок
    """
    assert decrypt(cipher) == expected
